In [88]:
import pandas as pd

In [89]:
data = {
    'names': ['Parjol', 'Sharwan', 'Narendra', 'Lokesh', 'Mote', 'Nirajan'],
    'score': [98,45,78,76,28,86],
    'sport': ['cricket', 'baseball', 'volleyball', 'football', 'futsal', 'wrestling']
}

In [90]:
data

{'names': ['Parjol', 'Sharwan', 'Narendra', 'Lokesh', 'Mote', 'Nirajan'],
 'score': [98, 45, 78, 76, 28, 86],
 'sport': ['cricket',
  'baseball',
  'volleyball',
  'football',
  'futsal',
  'wrestling']}

In [91]:
type(data)

dict

In [92]:
df = pd.DataFrame(data)

In [93]:
df

      names  score       sport
0    Parjol     98     cricket
1   Sharwan     45    baseball
2  Narendra     78  volleyball
3    Lokesh     76    football
4      Mote     28      futsal
5   Nirajan     86   wrestling

In [94]:
df.tail(4)   # last ko chai 4 wata data

      names  score       sport
2  Narendra     78  volleyball
3    Lokesh     76    football
4      Mote     28      futsal
5   Nirajan     86   wrestling

In [95]:
df = pd.DataFrame(data, columns = ['name', 'sport', 'gender', 'score', 'age'])

In [96]:
df

  name       sport gender  score  age
0  NaN     cricket    NaN     98  NaN
1  NaN    baseball    NaN     45  NaN
2  NaN  volleyball    NaN     78  NaN
3  NaN    football    NaN     76  NaN
4  NaN      futsal    NaN     28  NaN
5  NaN   wrestling    NaN     86  NaN

In [97]:
df = pd.DataFrame(data, columns = ['name', 'sport', 'gender', 'score', 'age'], index =['a', 'b', 'c','d','e','f'])

In [98]:
df

  name       sport gender  score  age
a  NaN     cricket    NaN     98  NaN
b  NaN    baseball    NaN     45  NaN
c  NaN  volleyball    NaN     78  NaN
d  NaN    football    NaN     76  NaN
e  NaN      futsal    NaN     28  NaN
f  NaN   wrestling    NaN     86  NaN

In [99]:
df['sport']

a       cricket
b      baseball
c    volleyball
d      football
e        futsal
f     wrestling
Name: sport, dtype: object

In [100]:
my_columns = ['sport', 'gender']
df[my_columns]

        sport gender
a     cricket    NaN
b    baseball    NaN
c  volleyball    NaN
d    football    NaN
e      futsal    NaN
f   wrestling    NaN

In [123]:
df.loc['a']

name          NaN
sport     cricket
gender        NaN
score          98
age           NaN
Name: a, dtype: object

In [124]:
df1 = pd.DataFrame(data, columns = ['names', 'sport', 'score', 'pass'])

In [143]:
df1

      names       sport  score
0    Parjol     cricket     98
1   Sharwan    baseball     45
2  Narendra  volleyball     78
3    Lokesh    football     76
4      Mote      futsal     28
5   Nirajan   wrestling     86

In [144]:
df1['pass'] = df1.score >= 70

In [145]:
df1

      names       sport  score   pass
0    Parjol     cricket     98   True
1   Sharwan    baseball     45  False
2  Narendra  volleyball     78   True
3    Lokesh    football     76   True
4      Mote      futsal     28  False
5   Nirajan   wrestling     86   True

In [146]:
del df1["pass"]

In [147]:
df1

      names       sport  score
0    Parjol     cricket     98
1   Sharwan    baseball     45
2  Narendra  volleyball     78
3    Lokesh    football     76
4      Mote      futsal     28
5   Nirajan   wrestling     86